import React from "react";
import { Link } from "react-router-dom";
import { BsArrowLeft } from "react-icons/bs";
import "./About.css";

export default function About() {
  return (
    <>
      <div className="Breadcrumb-About">
        <div className="Container-Breadcrumb-About">
          <Link to={"/"}>
            <span id="Breadcrumb-About-Home">خانه </span>
          </Link>

          <span>
            <BsArrowLeft />
          </span>
          <span id="Breadcrumb-About"> درباره ما </span>
        </div>
      </div>

      <div className="Container-About">
        <div className="Wrapper-About">
          <h1>درباره ما</h1>
          <p>
            اوایل سال 1400 شروع به آموزش در زمینه برنامه نویسی کردیم.ابتدا با
            دوستان متخصص در زمینه برنامه نویسی وب مشورت کرده و کارمان را با دیدن
            دوره های آموزشی به صورت خودآموز آغاز کردیم,زبان نشانه گذاری(html) ,
            زبان استایل دهی (css) را از سایت راکت در 2 ماه به پایان رسانده و در
            این زمینه تمرین ها و مینی پروژه هایی را نیز انجام دادیم سپس با
            آشنایی با وب سایت webProg.io در زمینه bootstrap به آموزش خود ادامه
            داده و بعد از گذراندن این دوره نیز و انجام پروژه به آموزش زبان
            برنامه نویسی JavaScript در این سایت پرداختیم .بعد از اتمام این آموزش
            به دلیل جامع نبودن این آموزش دنبال یک منبع بهتر برای آموزش
            جاوا اسکریپت بوده که با وب سایت سبزلرن آشنا شدیم که یک دوره جامع و
            کامل در زمینه جاوا اسکریپت آموزش میداد.دوره پیشرفته Js را از سبزلرن
            به همراه تمرینات و پروژه های این دوره به صورت قابل قبولی انجام داده
            و خود را به سطح خوبی در این زمینه رساندیم بعد از این دوره فریمورک ری
            اکت را در این سایت شروع کرده و دوره را با موفقیت و به صورت عالی تمام
            کرده و برای آماده کردن پروژه وب سایت خود دست به کد شدیم و یک وب سایت
            فروشگاهی که هم اکنون در اختیار شما قرار گرفته,انجام دادیم .
          </p>

          <p>
            در میان این آموزش ها ,آموزش git , github را نیز از سایت راکت و
            پروژهای خلاقانه با html , css و دوره regex را از سایت سبزلرن و scss
            را از سایت وب پروگ به پایان رساندیم.
          </p>

          <p>
            در پروژه نهایی از اکثر این آموزش ها استفاده نموده و پروژه در حال
            پیشرفت میباشد و ما نیز به آموزشهای خود ادامه می دهیم تا به سطح عالی
            در این زمینه برسیم.
          </p>
        </div>
      </div>
    </>
  );
}
