
// let AllProduct = [
//     {
//         MainCategory: { id: 1, title: 'چاقوی زنجان', imgName: '1.png', imgName2: 'چاقوی کلکسیونی دوتیغه.png' },
//         Info: [
//             {
//                 CategoryTitle: 'چاقوهای آشپزخانه',
//                 MainInfo: [
//                     { id: 1, Category: 'چاقوی آشپزی و سرآشپز', title: 'چاقوی سرآشپز مدل ژاپنی هومی', price: 3_000_000, productImgName: 'سرآشپز خاص مدل ژاپنی هومی.png', stock: 0, conter: 0, discount: 10, Weight: 231, genus: 'فولاد ضد زنگ', usage: 'مخصوص انواع گوشت وسبزیجات', Producer: 'استاد فولادوند' },
//                     { id: 2, Category: 'کارد آشپزخانه سلاخی', title: 'چاقوی سلاخی و پوست کن 18 سانتی', price: 173_000, productImgName: 'چاقوی_سلاخی_پوست_کن_18_سانتی.png', stock: 12, conter: 0, discount: 12, Weight: 106, genus: 'فولادفنر ماشین', usage: 'سلاخی و پوست کنی', Producer: 'استاد میری' },
//                     { id: 3, Category: 'کارد آشپزخانه دم دستی', title: 'چاقوی دم دستی 19 سانتی ناصر', price: 150_000, productImgName: 'چاقوی_دم_دستی_19_سانتی_ناصر-.png', stock: 1, conter: 0, discount: 2, Weight: 75, genus: '420ضد زنگ', usage: 'مناسب برای تهیه سالاد', Producer: 'استاد ناصر' },
//                     { id: 4, Category: 'کارد آشپزخانه دم دستی', title: 'چاقوی دم دستی غفاری تیغه استیل', price: 50_000, productImgName: 'چاقوی_دم_دستی_غفاری_استیل-.png', stock: 12, conter: 0, discount: 10, Weight: 135, genus: '420 ضد زنگ', usage: 'مصرف آشپزخانه', Producer: 'استاد غفاری' },
//                 ]
//             },
//             {
//                 CategoryTitle: 'چاقوی جیبی',
//                 MainInfo: [
//                     { id: 5, Category: 'چاقوی چوپانی زنجان', title: 'چاقوی چوپانی بزرگ بیگدلی', price: 100_000, productImgName: 'چاقوی_چوپانی_بزرگ_بیگدلی-.png', stock: 5, conter: 0, discount: 15, Weight: 175, genus: 'فنر ماشین', usage: 'ذبح حیوانات', Producer: 'استاد بیگدلی' },
//                     { id: 6, Category: 'چاقوی چوپانی زنجان', title: 'چاقوی چوپانی دسته کرم حمید', price: 1_050_000, productImgName: 'چاقوی_چوپانی_دسته_کرم_حمید-.png', stock: 8, conter: 0, discount: 10, Weight: 135, genus: '80crv2', usage: 'مناسب چوپان ها و ذبح حیوانات', Producer: 'استاد حمید دادو' },
//                 ]
//             },
//             {
//                 CategoryTitle: 'محصولات خاص و سفارشی',
//                 MainInfo: [
//                     { id: 7, Category: 'شمشیرهای موزه ای و تزئینی خاص', title: 'شمشیر عربی کلکسیونی با تیغه برنز', price: 2_500_000, productImgName: 'شمشیر_عربی_کلکسیونی_با_تیغه_برنز.png', stock: 1, conter: 0, discount: 3, Weight: 2000, genus: 'شمش برنز', usage: 'مناسب دکور و هدیه', Producer: 'استاد حیدری' },
//                     { id: 8, Category: 'چاقوهای سفارشی و خاص', title: 'چاقوی طرح عقاب با نوک مسی', price: 2_730_000, productImgName: 'چاقوی_طرح_عقاب_با_نوک_مسی-.png', stock: 10, conter: 0, discount: 17, Weight: 200, genus: 'فولاد-الیاژ مسی', usage: ' دکوری', Producer: 'استاد صمد زمانی' },
//                 ]
//             },
//         ]
//     },

//     {
//         MainCategory: { id: 2, title: 'ظروف مسی', imgName: 'لیوان مسی دسته دار.png', imgName2: 'لیوان مسی دسته دار.png' },
//         Info: [
//             {
//                 CategoryTitle: 'ظروف آشپزخانه',
//                 MainInfo: [
//                     { id: 10, Category: 'کتری و قوری مسی', title: 'کتری مسی چکشی', price: 436_000, productImgName: 'کتری_مسی_چکشی-.png', stock: 9, conter: 0, discount: 10, Weight: 1000, genus: 'کاملا مس', usage: 'تزئینات دکوری منزل', Producer: 'تولیدی اریا' },
//                     { id: 11, Category: 'پارچ مسی', title: 'پارچ مسی دسته برنجی', price: 561_000, productImgName: 'پارچ مسی دسته برنجی.png', stock: 4, conter: 0, discount: 10, Weight: 780, genus: 'برنج و مس', usage: 'استفاده در منزل', Producer: 'تولیدی اریا' },

//                 ]
//             },
//             {
//                 CategoryTitle: 'لوازم تزئینی مسی',
//                 MainInfo: [
//                     { id: 12, Category: 'شیرینی خوری و شکلات خوری', title: 'شکلات خوری مسی چکشی', price: 355_000, productImgName: 'شکلات_خوری_مسی_چکشی-.png', stock: 2, conter: 0, discount: 15, Weight: 200, genus: 'کاملا مس', usage: 'مناسب برای شکلات خوری', Producer: 'تولیدی اریا' },
//                     { id: 13, Category: 'دستبند مسی', title: 'دستبند پلاک گوسفند', price: 100_000, productImgName: 'دستبند_مس_پلاک_گوسفند-.png', stock: 5, conter: 0, discount: 20, Weight: 50, genus: 'چرم گاوی', usage: 'هدیه به دوستان', Producer: 'استاد تاران' },
//                     { id: 14, Category: 'دستبند مسی', title: 'دستبند پلاک فروهر', price: 150_000, productImgName: 'دستبند_مسی_فروهر.png', stock: 7, conter: 0, discount: 16, Weight: 50, genus: 'چرم گاوی', usage: 'هدیه به دوستان', Producer: 'استاد تاران' },
//                     { id: 15, Category: 'شیرینی خوری و شکلات خوری', title: 'شیرینی خوری مسی چکشی', price: 464_000, productImgName: 'شیرینی_خوری_چکشی-.png', stock: 9, conter: 0, discount: 10, Weight: 543, genus: 'کاملا مس', usage: 'مناسب برای شیرینی خوری', Producer: 'تولیدی اریا' },
//                     { id: 16, Category: 'سماورهای ذغالی', title: 'سماور ذغالی طرح شکمی 6 لیتری', price: 1_800_000, productImgName: 'سماور_ذغالی_طرح_شکمی_6_لیتری-.png', stock: 0, conter: 0, discount: 10, Weight: 4000, genus: 'مس خالص', usage: 'دکوراسیون منزل', Producer: 'استاد حسنی' },
//                     { id: 17, Category: 'شیرینی خوری و شکلات خوری', title: 'شکلات خوری درب دار بزرگ', price: 519_000, productImgName: 'شکلات_خوری_درب_دار_بزرگ-.png', stock: 9, conter: 0, discount: 10, Weight: 650, genus: 'مس', usage: 'شکلات خوری', Producer: 'استاد تاران' },
//                 ]
//             },
//         ]
//     },


//     {
//         MainCategory: { id: 3, title: 'میناکاری', imgName: "آجیل خوری مینا کاری.png", imgName2: "آجیل خوری مینا کاری.png" },
//         Info: [
//             {
//                 CategoryTitle: 'لوازم میناکاری',
//                 MainInfo: [
//                     { id: 18, Category: "بشقاب میناکاری", title: ' بشقاب میناکاری 30 سانتی   ', price: 350_000, productImgName: 'بشقاب_میناکاری_30سانتی-.png', stock: 15, conter: 0, discount: 10, Weight: 387, genus: 'سفالی', usage: 'دکوری', Producer: 'استاد نجفی' },
//                     { id: 19, Category: "بشقاب میناکاری", title: 'بشقاب میناکاری قهوه ای استاد محمدی', price: 250_000, productImgName: 'بشقاب_میناکاری_قهوه ای_استاد_محمدی-.png', stock: 15, conter: 0, discount: 5, Weight: 225, genus: 'سفالی', usage: 'تزئینی', Producer: 'استاد تاران' },
//                     { id: 20, Category: 'قندان میناکاری', title: 'قندان میناکاری بدون پایه', price: 85_000, productImgName: 'قندان_میناکاری_بدون_پایه-.png', stock: 7, conter: 0, discount: 10, Weight: 320, genus: 'سفالی', usage: 'مصرف روزانه', Producer: 'استاد تاران' },
//                     { id: 21, Category: 'قندان میناکاری', title: 'قندان میناکاری طرح سلطانیه', price: 150_000, productImgName: 'قندان_میناکاری_طرح_سلطانیه-.png', stock: 2, conter: 0, discount: 17, Weight: 20, genus: 'سفالی', usage: 'دکوری', Producer: 'استاد اسدی' },
//                     { id: 22, Category: "بشقاب میناکاری", title: 'بشقاب 19 سانتی میناکاری', price: 450_000, productImgName: 'بشقاب_19_سانتی_میناکاری-.png', stock: 3, conter: 0, discount: 11, Weight: 139, genus: 'سفالی', usage: 'دکوری', Producer: 'استاد تاران' },
//                     { id: 23, Category: "بشقاب میناکاری", title: "بشقاب میناکاری طرح رویا", price: 250_000, productImgName: 'بشقاب_میناکاری_طرح_رویا-.png', stock: 15, conter: 0, discount: 5, Weight: 220, genus: 'سفالی', usage: 'دکری', Producer: 'استاد تاران' },
//                     { id: 24, Category: "بشقاب میناکاری", title: "بشقاب میناکاری طرح مریم", price: 350_000, productImgName: 'بشقاب_میناکاری_طرح_مریم-.png', stock: 0, conter: 0, discount: 15, Weight: 200, genus: 'سفالی', usage: 'دکوری', Producer: 'استاد اسدی' },
//                     { id: 25, Category: 'قندان میناکاری', title: 'قندان پایه بلند میناکاری', price: 100_000, productImgName: 'قندان_پایه_بلند_میناکاری-.png', stock: 12, conter: 0, discount: 5, Weight: 300, genus: 'سفالی', usage: 'دکوری و مصارف تشریفاتی', Producer: 'استاد تاران' },
//                 ]
//             },

//         ]
//     },
// ]

// let ProposalProducts = [
//     {
//         MainProposalProduct: [
//             { id: 26, title: ' ست حرفه ای کارد و چنگال', price: 350_000, imgName: 'ست حرفه ای کارد و چنگال مخصوص استیک دستساز.png', stock: 9, conter: 0, discount: 20 },
//             { id: 27, title: 'قوری مسی', price: 170_000, imgName: 'قوری مسی.png', stock: 12, conter: 0, discount: 15 },
//             { id: 28, title: 'شیرینی خوری مسی', price: 200_000, imgName: 'شیرینی خوری مسی.png', stock: 7, conter: 5, discount: 10 },
//             { id: 29, title: 'شیرینی خوری مینا کاری', price: 250_000, imgName: 'شیرینی خوری پایه دار مینا کاری.png', stock: 11, conter: 0, discount: 20 },
//         ],
//         AllProposalProduct: [
//             { id: 17, Category: 'شیرینی خوری و شکلات خوری', title: 'شکلات خوری درب دار بزرگ', price: 519_000, productImgName: 'شکلات_خوری_درب_دار_بزرگ-.png', stock: 9, conter: 0, discount: 10 },
//             { id: 7, Category: 'شمشیرهای موزه ای و تزئینی خاص', title: 'شمشیر عربی کلکسیونی با تیغه برنز', price: 2_500_000, productImgName: 'شمشیر_عربی_کلکسیونی_با_تیغه_برنز.png', stock: 1, conter: 0, discount: 3 },
//             { id: 8, Category: 'چاقوهای سفارشی و خاص', title: 'چاقوی طرح عقاب با نوک مسی', price: 2_730_000, productImgName: 'چاقوی_طرح_عقاب_با_نوک_مسی-.png', stock: 10, conter: 0, discount: 17 },
//             { id: 19, Category: "بشقاب میناکاری", title: 'بشقاب میناکاری قهوه ای استاد محمدی', price: 250_000, productImgName: 'بشقاب_میناکاری_قهوه ای_استاد_محمدی-.png', stock: 15, conter: 0, discount: 5 },
//             { id: 20, Category: 'قندان میناکاری', title: 'قندان میناکاری بدون پایه', price: 85_000, productImgName: 'قندان_میناکاری_بدون_پایه-.png', stock: 7, conter: 0, discount: 10 },
//             { id: 3, Category: 'کارد آشپزخانه دم دستی', title: 'چاقوی دم دستی 19 سانتی ناصر', price: 150_000, productImgName: 'چاقوی_دم_دستی_19_سانتی_ناصر-.png', stock: 1, conter: 0, discount: 2 },
//             { id: 16, Category: 'سماورهای ذغالی', title: 'سماور ذغالی طرح شکمی 6 لیتری', price: 1_800_000, productImgName: 'سماور_ذغالی_طرح_شکمی_6_لیتری-.png', stock: 0, conter: 0, discount: 10 },
//             { id: 4, Category: 'کارد آشپزخانه دم دستی', title: 'چاقوی دم دستی غفاری تیغه استیل', price: 50_000, productImgName: 'چاقوی_دم_دستی_غفاری_استیل-.png', stock: 12, conter: 0, discount: 10 },
//             { id: 10, Category: 'کتری و قوری مسی', title: 'کتری مسی چکشی', price: 436_000, productImgName: 'کتری_مسی_چکشی-.png', stock: 9, conter: 0, discount: 10 },
//             { id: 38, title: 'بشقاب میناکاری', price: 250_000, productImgName: 'بشقاب_19_سانتی_میناکاری-.png', stock: 15, conter: 0, discount: 5 },
//         ],
//     }
// ]

// const FullProduct = []
// AllProduct.map(data => data.Info.map(productInfo => productInfo.MainInfo.map(product => {
//     FullProduct.push(product)
// })))


// ProposalProducts.map(products => {
//     products.MainProposalProduct.map(product => FullProduct.push(product))
//     products.AllProposalProduct.map(product => FullProduct.push(product))
// })

const ContactAnswerQuestionData = [
    {
        id: 1,
        answer: 'لورم ایپسوم متن ساختگی برای ایجاد (1)',
        question: 'لورم ایپسوم متن ساختگی برای ایجاد  لورم ایپسوم متن ساختگی  متن ساختگی برای ایجاد  لورم ایپسوم متن ساختگی برای ایجاد (1)'
    },
    {
        id: 2,
        answer: 'لورم ایپسوم متن ساختگی برای ایجاد (2)',
        question: 'لورم ایپسوم متن ساختگی برای ایجاد  لورم ایپسوم تن ساختگی برای ایجاد  لورم ایپسوم ایجاد  (2)'
    },
    {
        id: 3,
        answer: 'لورم ایپسوم متن ساختگی برای ایجاد (3)',
        question: 'لورم ایپسوم متن ساختگی برای ایجاد متن ساختگی برای ایجاد  لورم ایپسوم متن ساختگی  متن ساختگی برای ایجاد  لورم ایپسوم متن ساختگی  متن ساختگی برای ایجاد  لورم ایپسوم متن ساختگی متن ساختگی برای ایجاد  لورم ایپسوم متن ساختگی لورم ایپسوم متن ساختگی برای ایجاد (3)'
    },
    {
        id: 4,
        answer: 'لورم ایپسوم متن ساختگی برای ایجاد (4)',
        question: 'لورم ایپسوم متن ساختگی برای ایجاد  لورم ایپسوم متن ساختگی متن ساختگی برای ایجاد  لورم ایپسوم متن ساختگی برای ایجاد (4)'
    },
]



const MainArticleHomeData = [
    {
        id: 1,
        title: 'آشنایی با انواع چاقوی آشپزخانه',
        img: '41.jpg',
        paragraphCard: 'شاید تا به امروز به این نکته توجه نکرده باشید که چاقوهای آشپزخانه یک وسیله بسیار مهم و کاربردی هستند که نبودن یا کند بودن آن ها، می‌تواند شما را به عنوان یک آشپز اذیت کند.)',
        paragraphMain: `لورم ایپسوم متن 
        ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان
         که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع
         با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد 
        گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم
         افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی،
         و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت
         که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان 
        رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات 
        پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم
         متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم 
        است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود 
        ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،
         شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
         برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی
         ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه
         راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی 
        دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد 
        استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت 
        چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله 
        در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و 
        کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در 
        شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد،
         تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص 
        طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت 
        می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و
         شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
         دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای 
        موجود طراحی اساسا مورد استفاده قرار گیرد.1`
    },
]
const ArticleHomeData = [
    {
        id: 2,
        title: 'تاریخچه تولید چاقوی زنجان',
        img: 'article2.jfif',
        paragraphCard: 'شاید تا به امروز به این نکته توجه نکرده باشید که چاقوهای آشپزخانه یک وسیله بسیار مهم و کاربردی هستند که نبودن یا کند بودن آن ها، می‌تواند شما را به عنوان یک آشپز اذیت کند.(2)',
        paragraphMain: `لورم ایپسوم متن 
        ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان
         که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع
         با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد 
        گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم
         افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی،
         و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت
         که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان 
        رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات 
        پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم
         متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم 
        است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود 
        ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،
         شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
         برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی
         ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه
         راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی 
        دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد 
        استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت 
        چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله 
        در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و 
        کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در 
        شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد،
         تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص 
        طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت 
        می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و
         شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
         دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای 
        موجود طراحی اساسا مورد استفاده قرار گیرد.2`
    },
    {
        id: 3,
        title: 'ظرافت طرح های میناکاری',
        img: 'article3.jfif',
        paragraphCard: 'شاید تا به امروز به این نکته توجه نکرده باشید که چاقوهای آشپزخانه یک وسیله بسیار مهم و کاربردی هستند که نبودن یا کند بودن آن ها، می‌تواند شما را به عنوان یک آشپز اذیت کند.(3)',
        paragraphMain: `لورم ایپسوم متن 
        ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان
         که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع
         با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد 
        گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم
         افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی،
         و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت
         که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان 
        رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات 
        پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم
         متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم 
        است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود 
        ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،
         شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
         برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی
         ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه
         راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی 
        دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد 
        استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت 
        چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله 
        در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و 
        کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در 
        شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد،
         تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص 
        طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت 
        می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و
         شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
         دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای 
        موجود طراحی اساسا مورد استفاده قرار گیرد.3`
    },
    {
        id: 4,
        title: "کارگاه های کوچک سنتی مسگری رو به سوی صنعتی شدن",
        img: 'article4.jfif',
        paragraphCard: 'شاید تا به امروز به این نکته توجه نکرده باشید که چاقوهای آشپزخانه یک وسیله بسیار مهم و کاربردی هستند که نبودن یا کند بودن آن ها، می‌تواند شما را به عنوان یک آشپز اذیت کند.(4)',
        paragraphMain: `لورم ایپسوم متن 
        ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان
         که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع
         با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد 
        گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم
         افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی،
         و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت
         که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان 
        رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات 
        پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم
         متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم 
        است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود 
        ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،
         شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
         برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی
         ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه
         راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی 
        دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد 
        استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت 
        چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله 
        در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و 
        کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در 
        شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد،
         تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص 
        طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت 
        می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و
         شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
         دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای 
        موجود طراحی اساسا مورد استفاده قرار گیرد.4`
    }
]
const ArticlesData = [
    {
        id: 5,
        title: 'محبوبیت چاقوی زنجان در ایران و جهان',
        img: 'article5.jfif',
        paragraphCard: 'شاید تا به امروز به این نکته توجه نکرده باشید که چاقوهای آشپزخانه یک وسیله بسیار مهم و کاربردی هستند که نبودن یا کند بودن آن ها، می‌تواند شما را به عنوان یک آشپز اذیت کند.(5)',
        paragraphMain: `لورم ایپسوم متن 
        ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان
         که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع
         با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد 
        گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم
         افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی،
         و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت
         که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان 
        رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات 
        پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم
         متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم 
        است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود 
        ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،
         شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
         برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی
         ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه
         راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی 
        دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد 
        استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت 
        چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله 
        در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و 
        کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در 
        شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد،
         تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص 
        طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت 
        می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و
         شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
         دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای 
        موجود طراحی اساسا مورد استفاده قرار گیرد.5`
    },
    {
        id: 6,
        title: 'مراحل ساخت چاقو به روش سنتی',
        img: 'article6.jfif',
        paragraphCard: 'شاید تا به امروز به این نکته توجه نکرده باشید که چاقوهای آشپزخانه یک وسیله بسیار مهم و کاربردی هستند که نبودن یا کند بودن آن ها، می‌تواند شما را به عنوان یک آشپز اذیت کند.(6)',
        paragraphMain: `لورم ایپسوم متن 
        ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان
         که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع
         با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد 
        گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم
         افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی،
         و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت
         که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان 
        رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات 
        پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم
         متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم 
        است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود 
        ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،
         شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
         برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی
         ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه
         راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی 
        دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد 
        استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت 
        چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله 
        در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و 
        کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در 
        شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد،
         تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص 
        طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت 
        می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و
         شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
         دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای 
        موجود طراحی اساسا مورد استفاده قرار گیرد.6`
    },
    {
        id: 7,
        title: 'گسترش تولید مس به روش صنعتی در زنجان',
        img: 'article7.jfif',
        paragraphCard: 'شاید تا به امروز به این نکته توجه نکرده باشید که چاقوهای آشپزخانه یک وسیله بسیار مهم و کاربردی هستند که نبودن یا کند بودن آن ها، می‌تواند شما را به عنوان یک آشپز اذیت کند.(7)',
        paragraphMain: `لورم ایپسوم متن 
        ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان
         که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع
         با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد 
        گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم
         افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی،
         و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت
         که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان 
        رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات 
        پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم
         متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم 
        است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود 
        ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،
         شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
         برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی
         ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه
         راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی 
        دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد 
        استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت 
        چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله 
        در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و 
        کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در 
        شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد،
         تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص 
        طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت 
        می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و
         شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
         دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای 
        موجود طراحی اساسا مورد استفاده قرار گیرد.7`
    },
    {
        id: 8,
        title: 'تشخیص دست ساز بودن ظروف مسی',
        img: 'article8.jfif',
        paragraphCard: 'شاید تا به امروز به این نکته توجه نکرده باشید که چاقوهای آشپزخانه یک وسیله بسیار مهم و کاربردی هستند که نبودن یا کند بودن آن ها، می‌تواند شما را به عنوان یک آشپز اذیت کند.(8)',
        paragraphMain: `لورم ایپسوم متن 
        ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان
         که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع
         با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد 
        گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم
         افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی،
         و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت
         که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان 
        رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات 
        پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم
         متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم 
        است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود 
        ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،
         شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
         برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی
         ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه
         راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی 
        دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد 
        استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت 
        چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله 
        در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و 
        کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در 
        شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد،
         تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص 
        طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت 
        می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و
         شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
         دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای 
        موجود طراحی اساسا مورد استفاده قرار گیرد.8`
    },
    {
        id: 9,
        title: 'آشنایی با هنرمندان صنعت میناکاری زنجان',
        img: 'article9.jfif',
        paragraphCard: 'شاید تا به امروز به این نکته توجه نکرده باشید که چاقوهای آشپزخانه یک وسیله بسیار مهم و کاربردی هستند که نبودن یا کند بودن آن ها، می‌تواند شما را به عنوان یک آشپز اذیت کند.(9)',
        paragraphMain: `لورم ایپسوم متن 
        ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان
         که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع
         با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد 
        گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم
         افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی،
         و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت
         که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان 
        رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات 
        پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم
         متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم 
        است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود 
        ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،
         شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
         برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی
         ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه
         راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی 
        دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد 
        استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت 
        چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله 
        در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و 
        کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در 
        شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد،
         تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص 
        طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت 
        می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و
         شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
         دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای 
        موجود طراحی اساسا مورد استفاده قرار گیرد.9`
    },
    {
        id: 10,
        title: 'زیبایی خانه با صنایع میناکاری',
        img: 'article10.jfif',
        paragraphCard: 'شاید تا به امروز به این نکته توجه نکرده باشید که چاقوهای آشپزخانه یک وسیله بسیار مهم و کاربردی هستند که نبودن یا کند بودن آن ها، می‌تواند شما را به عنوان یک آشپز اذیت کند.(10)',
        paragraphMain: `لورم ایپسوم متن 
        ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان
         که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع
         با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد 
        گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم
         افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی،
         و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت
         که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان 
        رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات 
        پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم
         متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان 
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم 
        است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود 
        ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،
         شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
         برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی
         ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه
         راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی 
        دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد 
        استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت 
        چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله 
        در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و 
        کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در 
        شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد،
         تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص 
        طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت 
        می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و
         شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی
         دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای 
        موجود طراحی اساسا مورد استفاده قرار گیرد.10`
    },
]

const AllArticle = [MainArticleHomeData[0]]
ArticleHomeData.map(article => AllArticle.push(article))
ArticlesData.map(article => AllArticle.push(article))


export {  ContactAnswerQuestionData, MainArticleHomeData, ArticleHomeData, ArticlesData, AllArticle }